app/Helpers/helpers.php

select * from `companies` where `companies`.`id` is null limit 1
---
function getCurrentCompany()
{
	$companyIdentifier = Request()->segment(2);
	return Company::find($companyIdentifier);