app/Models/Traits/Mutators/HospitalitySectorMutator.php

	public function updateMainSection(Request $request)
	{
		// $dates  = $this->getDatesIndexesHelper();


		$this->update(array_merge($request->only($this->getMainFields()), [
			'has_other_section' => $request->boolean('has_other_section'),
			'has_meeting_section' => $request->boolean('has_meeting_section'),
			'has_casino_section' => $request->boolean('has_casino_section'),
			'has_food_section' => $request->boolean('has_food_section')
		]));
		$hospitalitySector = $this->refresh();
		$datesAsStringAndIndex = $hospitalitySector->getDatesAsStringAndIndex();
		$studyDates = $hospitalitySector->getStudyDates() ;
		$datesAndIndexesHelpers = $hospitalitySector->datesAndIndexesHelpers($studyDates);
		$datesIndexWithYearIndex=$datesAndIndexesHelpers['datesIndexWithYearIndex'];
		$yearIndexWithYear=$datesAndIndexesHelpers['yearIndexWithYear'];
		$dateIndexWithDate=$datesAndIndexesHelpers['dateIndexWithDate'];
		$dateWithMonthNumber=$datesAndIndexesHelpers['dateWithMonthNumber'];

		$this->updateStudyAndOperationDates($datesAsStringAndIndex,$datesIndexWithYearIndex,$yearIndexWithYear,$dateIndexWithDate,$dateWithMonthNumber);
---
update `hospitality_sectors` set `state_id` = '1', `development_start_date` = '05/01/2026', `has_casino_section` = 0, `has_meeting_section` = 0, `has_other_section` = 1, `hospitality_sectors`.`updated_at` = '2025-08-24 13:29:47' where `id` = 315

	public function updateStudyAndOperationDates(array $datesAsStringAndIndex,array $datesIndexWithYearIndex,array $yearIndexWithYear,array $dateIndexWithDate,array $dateWithMonthNumber)
	{
		$operationDurationDates = $this->getOperationDurationPerMonth($datesAsStringAndIndex,$datesIndexWithYearIndex,$yearIndexWithYear,$dateIndexWithDate,$dateWithMonthNumber,false);



		$studyDurationDates = $this->getStudyDurationPerMonth($datesAsStringAndIndex,$datesIndexWithYearIndex,$yearIndexWithYear,$dateIndexWithDate,$dateWithMonthNumber,false);
		$operationDurationDates = $this->editOperationDatesStartingIndex($operationDurationDates,$studyDurationDates);
		$this->update([
			'study_dates'=>$studyDurationDates,
			'operation_dates'=>$operationDurationDates,
			// 'development_start_date'=>$developmentStartDateAsIndex,
		]);

		$datesAsStringAndIndex = $this->getDatesAsStringAndIndex();

		$developmentStartDateAsString = Carbon::make($this->development_start_date)->format('d-m-Y') ;

		$developmentStartDateAsIndex = $datesAsStringAndIndex[$developmentStartDateAsString] ;
		$this->update([
			'development_start_date'=>$developmentStartDateAsIndex,
		]);
---
update `hospitality_sectors` set `development_start_date` = 4, `hospitality_sectors`.`updated_at` = '2025-09-15 17:23:15' where `id` = 316