app/Models/Traits/Accessors/FoodAccessor.php

	public function getName(): string
	{
		$foodsId = $this->getFoodIdentifier();
		return FoodName::find($foodsId)->getName();
---
select * from `food_names` where `food_names`.`id` = 18 limit 1