app/Models/Traits/Accessors/HospitalitySectorAccessor.php

	public function getCurrenciesForSelect(): array
	{
		$result = [];
		$mainCurrencyId = $this->getMainFunctionalCurrency();
		$additionalCurrencyId = $this->getAdditionalCurrency();
		$currencies = formatOptionsForSelect(Currency::get(), 'getId', 'getName');
---
select * from `currencies`

	public function getMaxPracticalAvailableNights(array $maxAvailableNightsNights,array $dateIndexWithMonthNumber)
	{
		$maxPracticalAvailableNights = [];
		// $seasonality = convertJsonToArray($this->seasonality);
		$rooms = $this->getRoomsForLooping($this->rooms->load('hospitalitySector'), $this);
---
select * from `hospitality_sectors` where `hospitality_sectors`.`id` in (316)

	public function getAcquisition()
	{
		$acquisition = $this->acquisition ;
		return $acquisition ? $acquisition->load('loans'):null;
---
select * from `acquisitions` where `acquisitions`.`hospitality_sector_id` = 316 and `acquisitions`.`hospitality_sector_id` is not null limit 1
select * from `loans` where `loans`.`acquisition_id` in (20)

	public function getPropertyAcquisition()
	{
		$propertyAcquisition =$this->propertyAcquisition ;
		return $propertyAcquisition ? $propertyAcquisition->load('loans') : null;
---
select * from `property_acquisitions` where `property_acquisitions`.`hospitality_sector_id` = 316 and `property_acquisitions`.`hospitality_sector_id` is not null limit 1
select * from `loans` where `loans`.`acquisition_id` in (28)