app/Models/Traits/Accessors/MeetingAccessor.php

	public function getName(): string
	{
		$meetingId = $this->getMeetingIdentifier();
		return MeetingName::find($meetingId)->getName();
---
select * from `meeting_names` where `meeting_names`.`id` = 14 limit 1