app/Models/Traits/Accessors/OtherAccessor.php

	public function getName(): string
	{
		$otherIdentifier = $this->getOtherIdentifier();
		return OtherName::find($otherIdentifier)->getName();
---
select * from `other_names` where `other_names`.`id` = 19 limit 1