app/Models/Traits/Accessors/RoomAccessor.php

	public function getName(): string
	{
		$roomId = $this->room_type_id;
		if(is_null($roomId)){
			$roomId = getCurrentCompany()->getTotalRoomId();
		}
		return  RoomName::find($roomId)->getName();
---
select * from `room_names` where `room_names`.`id` = 63 limit 1