app/Http/Controllers/HospitalitySectorController.php

select * from `hospitality_sectors` where `company_id` = 41
---
	public function view(Request $request)
	{

			$numberOfMonthsBetweenEndDateAndStartDate = 18 ;
		$currentType = $request->get('active',HospitalitySector::STUDY);

		$filterDates = [];
		foreach([HospitalitySector::STUDY] as $type){
			$startDate = $request->has('startDate') ? $request->input('startDate.'.$type) : now()->subMonths($numberOfMonthsBetweenEndDateAndStartDate)->format('Y-m-d');
			$endDate = $request->has('endDate') ? $request->input('endDate.'.$type) : now()->format('Y-m-d');

			$filterDates[$type] = [
				'startDate'=>$startDate,
				'endDate'=>$endDate
			];
		}



		  /**
		 * * start of bank to safe internal money transfer
		 */

		$startDate = $filterDates[HospitalitySector::STUDY]['startDate'] ?? null ;
		$endDate = $filterDates[HospitalitySector::STUDY]['endDate'] ?? null ;
		$models = HospitalitySector::onlyCurrentCompany()->get();

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewRooms($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
---
	public function viewFoods($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
select * from `foods` where `foods`.`hospitality_sector_id` = 315 and `foods`.`hospitality_sector_id` is not null
---
	public function storeFoods(Request $request, Company $company, $hospitalitySectorId)
	{

		$companyId = $company->id;

		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

		$foods = $hospitalitySector->foods;
		$message = __('Food & Beverages "F&B" Projections has been saved successfully');
		if ($request->get('redirect-to-same-page')) {
			$redirectUrl = route('admin.view.hospitality.sector.foods', [$companyId, $hospitalitySectorId]);
			$message = __('Please Wait');
		} else {
			$redirectUrl = route($this->getRedirectUrlName($hospitalitySector, 'food'), [$companyId, $hospitalitySectorId]);
		}
		$hospitalitySector->update([
			'food_collection_policy_type' => $collectionPolicyType = $request->get('food_collection_policy_type'),
			'foods_general_collection_policy_type'=>($isGeneralSystemDefault = (bool)$request->get('is_general_system_default')) ? 'system_default' : 'customize',
			'foods_general_collection_policy_interval'=>$collectionPolicyType == 'general_collection_terms'&& $isGeneralSystemDefault ? $request->get('general_system_default') : null,
			'foods_general_collection_policy_value'=>$collectionPolicyType == 'general_collection_terms'&& !$isGeneralSystemDefault ? convertArrayToJson($request->input('sub_items.general_collection_policy.type.value')) : null,
			'has_visit_food_section'=>true
		]);

select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` in (315)
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
---
	public function viewOtherRevenues($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::with('departmentExpenses')->find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
---
	public function storeOtherRevenues(Request $request, Company $company, $hospitalitySectorId)
	{
		$companyId = $company->id;
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
---
	public function viewRoomsDirectExpenses($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
update `hospitality_sectors` set `has_rooms_manpower` = 1, `hospitality_sectors`.`updated_at` = '2025-08-24 13:30:58' where `id` = 315
select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` = 315 and `department_expenses`.`hospitality_sector_id` is not null and `section_name` = 'variable_expenses_as_cost_per_night_sold' and `model_name` = 'rooms'
---
	public function storeRoomsDirectExpenses(Request $request, Company $company, $hospitalitySectorId)
	{
		$companyId = $company->id;
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);
		$hasRoomManpower = $request->boolean('has_rooms_manpower');
		$modelName = $request->input('model_name');
		$hospitalitySector->update([
			'has_rooms_manpower' => $hasRoomManpower
		]);
		$namesWithOldNames = [];
		foreach ((array)$request->get('name') as $currentSectionName => $sectionItemsNames) {
			foreach ($sectionItemsNames as $index => $newName) {
				$oldName = $request->input('old_name.' . $currentSectionName . '.' . $index);
				$namesWithOldNames[$currentSectionName][$index] = [
					$oldName => $newName
				];

				$data = $this->getCommonStoreData($request, $currentSectionName, $index, $newName, $modelName, $companyId, $hospitalitySectorId);

				if ($newName && !$oldName) {
					$hospitalitySector->departmentExpenses()->create($data);
				}
				if ($newName && $oldName) {
					$currentDepartmentExpense = $hospitalitySector->departmentExpensesFor($currentSectionName, $modelName)->get()[$index];

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
update `ffe` set `created_at` = '2025-08-26 15:18:39', `start_date` = 0, `end_date` = 6, `ffe_equity_funding` = '50', `ffe`.`updated_at` = '2025-08-26 15:18:39' where `id` = 15
select * from `ffe` where `ffe`.`hospitality_sector_id` = 316 and `ffe`.`hospitality_sector_id` is not null limit 1
---
	public function storeFFECost(Request $request, Company $company, $hospitalitySectorId)
	{

		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);
		$ffeEndDate  = $request->get('end_date');
		if(
			Carbon::make($hospitalitySector->getOperationStartDateFormatted())->lessThan(Carbon::make($ffeEndDate))){
			return response()->json([
				'status'=>false ,
				'message'=>__('FFE End Date Must Be Less Than Or Equal Operation Start Date')
			],400);
		}

		$companyId = $company->id;
		$modelName = $request->input('model_name');
		$ffe = $hospitalitySector->ffe;
		$ffeData = $this->getFFEData($request,$hospitalitySector);

		if ($ffe) {
			$ffe->update($ffeData);
		} else {
			$ffe = $hospitalitySector->ffe()->create($ffeData);
		}
		$ffeId =$ffe->id;
		$ffe->storeLoans($hospitalitySector->id,$request->get('loans'), $companyId, $ffeId);

select * from `ffe_items` where `ffe_items`.`hospitality_sector_id` = 316 and `ffe_items`.`hospitality_sector_id` is not null and `section_name` = 'ffe_cost' and `model_name` = 'ffe'
---
					$hospitalitySector->ffeItems()->create($data);
				}
				if ($newName && $oldName) {
					$currentFFEItems = $hospitalitySector->ffeItemsFor($currentSectionName, $modelName)->get()[$index];

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
---
	public function viewFoodsDirectExpenses($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewFFECost($companyId, $hospitalitySectorId)
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '315' limit 1
select * from `saleschannels` where `saleschannels`.`hospitality_sector_id` = 315 and `saleschannels`.`hospitality_sector_id` is not null
select * from `rooms` where `rooms`.`hospitality_sector_id` = 315 and `rooms`.`hospitality_sector_id` is not null
---
	public function storeRooms(Request $request, Company $company, $hospitalitySectorId)
	{
		$companyId = $company->id;

		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);
		$occupancyRateType = $request->get('occupancy_rate_type');
		$seasonalityType = $request->get('seasonality_type');
		$seasonalityInterval = $request->get('seasonality_interval');
		// $hasSalesChannelShareDiscount = $request->get('add_sales_channels_share_discount');
		$hasSalesChannelShareDiscount = $hospitalitySector->salesChannels->count();

		$generalSeasonality = $this->getGeneralSeasonality($seasonalityType, $seasonalityInterval, $request);
		$hospitalitySector->update([
			'general_occupancy_rate' => $occupancyRateType == 'general_occupancy_rate' ? json_encode((array)$request->get('general_occupancy_rate')) : null,
			'seasonality_type' => $seasonalityType,
			'seasonality_interval' => $seasonalityInterval,
			'exchange_rates'=>json_encode($request->get('exchange_rates',[])),
			'general_seasonality' => $generalSeasonality,
			'add_sales_channels_share_discount' => $hasSalesChannelShareDiscount,
			'room_collection_policy_type' => $collectionPolicyType = $request->get('room_collection_policy_type'),
			'rooms_general_collection_policy_type'=>($isGeneralSystemDefault = (bool)$request->get('is_general_system_default')) ? 'system_default' : 'customize',
			'rooms_general_collection_policy_interval'=>$collectionPolicyType == 'general_collection_terms'&& $isGeneralSystemDefault ? $request->get('general_system_default') : null,
			'rooms_general_collection_policy_value'=>$collectionPolicyType == 'general_collection_terms'&& !$isGeneralSystemDefault ? convertArrayToJson($request->input('sub_items.general_collection_policy.type.value')) : null,
			'has_visit_room_section'=>true
		]);

		foreach ($hospitalitySector->rooms as $room) {
			$roomIdentifier = $room->getRoomIdentifier();


			$occupancyRatePerRoom = $occupancyRateType == 'occupancy_rate_per_room' ? (array)$request->get('occupancy_rate_per_room')[$room->getRoomIdentifier()] : [];

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewFixedAssetsStatement($companyId, $hospitalitySectorId)
	{
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewPropertyTaxesPaymentStatement($companyId, $hospitalitySectorId)
	{
		$propertyTaxesStatementService = new PropertyTaxesPayableEndBalance();
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewFixedAssetPayableStatementForConstruction($companyId, $hospitalitySectorId)
	{
		$company = Company::find($companyId);
		$datesIndexWithYearIndex = App('datesIndexWithYearIndex');
		$yearIndexWithYear = App('yearIndexWithYear');
		$dateIndexWithDate = App('dateIndexWithDate');
		$dateWithDateIndex = App('dateWithDateIndex');
		$dateWithMonthNumber = App('dateWithMonthNumber');
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewIncomeStatementDashboard($companyId, $hospitalitySectorId)
	{
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` in (316)
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewStudyDashboard(Request $request, $companyId, $hospitalitySectorId,$returnArr = false)
	{
		// $start = microtime(true);
		$revenueChartOnly = isset($request['is_ajax']) && $request->get('chart_name') == 'revenue-stream' ;

		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId)->load(['departmentExpenses']);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` in (316)
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewCashInOutReport($companyId, $hospitalitySectorId , $returnReportItemsWithDashboardItems = false ,$onlyTotalHotelRevenue = false  )
	{
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId)->load(['departmentExpenses']);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` in (316)
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewBalanceSheetReport($companyId, $hospitalitySectorId , $returnItems = false )
	{
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId)->load(['departmentExpenses']);

select * from `companies` where `companies`.`id` = '41' limit 1
select * from `department_expenses` where `department_expenses`.`hospitality_sector_id` in (316)
select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	public function viewRatioAnalysisReport($companyId, $hospitalitySectorId )
	{
		$company = Company::find($companyId);
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId)->load(['departmentExpenses']);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
---
	protected function getCommonNavigators($companyId, $hospitalitySectorId):array
	{
		$hospitalitySector = HospitalitySector::find($hospitalitySectorId);

select * from `hospitality_sectors` where `hospitality_sectors`.`id` = '316' limit 1
select * from `hospitality_sectors` where `company_id` = 41 and `id` != 316 and `duration_in_years` = 7 and `study_start_date` = '01/01/2026'
---
	public function filterSecondHospitalitySector(Request $request,Company $company)
	{
		$firstHospitalitySector = HospitalitySector::find($request->get('firstId'));
		$duration = $firstHospitalitySector->duration_in_years;
		$studyStartDate = $firstHospitalitySector->study_start_date;
		$secondSectors = HospitalitySector::where('company_id',$company->id)->where('id','!=',$firstHospitalitySector->id)->where('duration_in_years',$duration)->where('study_start_date',$studyStartDate)->get();