app/Models/Company.php

	public function getRoomExceptTotal()
	{
		$firstRoom = $this->getTotalRoomId();
		return $this->roomNames->where('id','!=',$firstRoom);
---
select * from `room_names` where `room_names`.`company_id` = 41 and `room_names`.`company_id` is not null

	public function getFoodExceptTotal()
	{
		$firstFood = $this->getTotalFoodId();
		return $this->foodNames->where('id','!=',$firstFood);
---
select * from `food_names` where `food_names`.`company_id` = 41 and `food_names`.`company_id` is not null