app/Models/FFE.php

	public function getTotalItemsCost():float
	{

		$total = 0;
		$this->ffeItems->each(function($ffeItem) use (&$total){
			$total += $ffeItem->getItemCost() * (1+($ffeItem->getContingencyRate()/100));
		});
---
select * from `ffe_items` where `ffe_items`.`ffe_id` = 15 and `ffe_items`.`ffe_id` is not null

	public function storeLoans(int $hospitalitySectorId,array $loans,int $companyId,int $ffeId)
	{
			foreach($loans as $sectionName=>$arrayOfData){
				$loan = $this->getLoanForSection($sectionName) ;
				$loanType = $arrayOfData['loan_type'] ?? null ;
				$data = array_merge($arrayOfData,['company_id'=>$companyId,'section_name'=>$sectionName,'ffe_id'=>$ffeId,'fixedLoanType'=>'fixed.loan.fixed.at.end',
				'capitalization_type'=>Loan::getCapitalizationType($loanType),
				'hospitality_sector_id'=>$hospitalitySectorId

			]);
				if($loan){
					$loan->update($data);
				}else{
					$this->loans()->create($data);
---
update `loans` set `installment_interval` = 'monthly', `period` = '60', `base_rate` = '0', `margin_rate` = '20', `pricing` = '20', `loans`.`updated_at` = '2025-08-26 15:19:59' where `id` = 15
insert into `loans` (`loan_type`, `base_rate`, `margin_rate`, `pricing`, `period`, `grace_period`, `capitalization_type`, `step_up_rate`, `step_up_interval`, `step_down_rate`, `step_down_interval`, `company_id`, `section_name`, `ffe_id`, `hospitality_sector_id`, `id`, `updated_at`, `created_at`) values ('normal', '', '', '0', '0', '0', '', '0', '', '0', '', 41, 'ffe_cost', 15, 316, 15, '2025-08-26 15:18:39', '2025-08-26 15:18:39')