app/Models/HospitalitySector.php

select * from `companies` where `companies`.`id` = 41 limit 1
---
	public static function getViewVars(): array
	{
		$currentCompanyId =  getCurrentCompanyId();

		return [
			'getDataRoute' => route('admin.get.hospitality.sector', ['company' => $currentCompanyId]),
			'modelName' => 'HospitalitySector',
			'exportRoute' => route('admin.export.hospitality.sector', $currentCompanyId),
			'createRoute' => route('admin.create.hospitality.sector', $currentCompanyId),
			'storeRoute' => route('admin.store.hospitality.sector', $currentCompanyId),
			'hasChildRows' => false,
			'pageTitle' => HospitalitySector::getPageTitle(),
			'redirectAfterSubmitRoute' => route('admin.view.hospitality.sector', $currentCompanyId),
			'type' => 'create',
			'company' => Company::find($currentCompanyId),