app/Providers/AppServiceProvider.php

select * from `sections` where `sections`.`id` = 2 and `sections`.`deleted_at` is null limit 1
---


				if (request()->route()->named('home') || (!isset(request()->company))) {
					$sections = [Section::with('subSections')->find(2)];